cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>RTCPS1CTL</name>
          <description>Real Timer Prescale Timer 1 Control</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RT1PSIFG</name>
              <description>RTC Prescale Timer 1 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1PSIE</name>
              <description>RTC Prescale Timer 1 Interrupt Enable Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1IP</name>
              <description>RTC Prescale Timer 1 Interrupt Interval Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1IP_0</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_1</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_2</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_3</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_4</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_5</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_6</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_7</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1PSHOLD</name>
              <description>RTC Prescale Timer 1 Hold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1PSDIV</name>
              <description>RTC Prescale Timer 1 Clock Divide Bit: 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1PSDIV_0</name>
                  <description>RTC Prescale Timer 1 Clock Divide /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_1</name>
                  <description>RTC Prescale Timer 1 Clock Divide /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_2</name>
                  <description>RTC Prescale Timer 1 Clock Divide /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_3</name>
                  <description>RTC Prescale Timer 1 Clock Divide /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_4</name>
                  <description>RTC Prescale Timer 1 Clock Divide /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_5</name>
                  <description>RTC Prescale Timer 1 Clock Divide /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_6</name>
                  <description>RTC Prescale Timer 1 Clock Divide /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1PSDIV_7</name>
                  <description>RTC Prescale Timer 1 Clock Divide /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1SSEL</name>
              <description>RTC Prescale Timer 1 Source Select Bit 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1SSEL_0</name>
                  <description>RTC Prescale Timer Source Select ACLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1SSEL_1</name>
                  <description>RTC Prescale Timer Source Select SMCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1SSEL_2</name>
                  <description>RTC Prescale Timer Source Select RT0PS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1SSEL_3</name>
                  <description>RTC Prescale Timer Source Select RT0PS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCPS</name>
          <description>Real Timer Prescale Timer Control</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCIV</name>
          <description>Real Time Clock Interrupt Vector</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCYEAR</name>
          <description>Real Time Clock Year</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
