cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>UCA0IFG</name>
          <description>USCI A0 Interrupt Flags Register</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>USCI Receive Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>USCI Transmit Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IV</name>
          <description>USCI A0 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_A0_SPI_MODE</name>
      <description>USCI_A0  SPI Mode</description>
      <baseAddress>1472</baseAddress>
      <registers>
        <register>
          <name>UCA0CTL1_SPI</name>
          <description>USCI A0 Control Register 1</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>USCI Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>USCI 1 Clock Source Select 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <description>USCI 0 Clock Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <description>USCI 0 Clock Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <description>USCI 0 Clock Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <description>USCI 0 Clock Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0CTL0_SPI</name>
          <description>USCI A0 Control Register 0</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSYNC</name>
              <description>Sync-Mode  0:UART-Mode / 1:SPI-Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMODE</name>
              <description>Sync. Mode: USCI Mode 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <description>Sync. Mode: USCI Mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <description>Sync. Mode: USCI Mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <description>Sync. Mode: USCI Mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <description>Sync. Mode: USCI Mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>Sync. Mode: Master Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>Sync. Mode: Data Bits 0:8-bits / 1:7-bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMSB</name>
              <description>Sync. Mode: MSB first 0:LSB / 1:MSB</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCCKPL</name>
              <description>Sync. Mode: Clock Polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCCKPH</name>
              <description>Sync. Mode: Clock Phase</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0BR0_SPI</name>
          <description>USCI A0 Baud Rate 0</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0BR1_SPI</name>
          <description>USCI A0 Baud Rate 1</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0MCTL_SPI</name>
          <description>USCI A0 Modulation Control</description>
          <addressOffset>8</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0STAT_SPI</name>
          <description>USCI A0 Status Register</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>USCI Busy Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCOE</name>
              <description>USCI Overrun Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCFE</name>
              <description>USCI Frame Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>USCI Listen mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0RXBUF_SPI</name>
          <description>USCI A0 Receive Buffer</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0TXBUF_SPI</name>
          <description>USCI A0 Transmit Buffer</description>
          <addressOffset>14</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0IE_SPI</name>
          <description>USCI A0 Interrupt Enable Register</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>USCI Receive Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>USCI Transmit Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTTIE</name>
              <description>START Condition interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTPIE</name>
              <description>STOP Condition interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCALIE</name>
              <description>Arbitration Lost interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCNACKIE</name>
              <description>NACK Condition interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IFG_SPI</name>
          <description>USCI A0 Interrupt Flags Register</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>USCI Receive Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>USCI Transmit Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IV_SPI</name>
          <description>USCI A0 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
