cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>ADC12CTL1</name>
          <description>ADC12+ Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12BUSY</name>
              <description>ADC12 Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12CONSEQ</name>
              <description>ADC12 Conversion Sequence Select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12CONSEQ_0</name>
                  <description>ADC12 Conversion Sequence Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_1</name>
                  <description>ADC12 Conversion Sequence Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_2</name>
                  <description>ADC12 Conversion Sequence Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_3</name>
                  <description>ADC12 Conversion Sequence Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SSEL</name>
              <description>ADC12 Clock Source Select Bit: 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SSEL_0</name>
                  <description>ADC12 Clock Source Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_1</name>
                  <description>ADC12 Clock Source Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_2</name>
                  <description>ADC12 Clock Source Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_3</name>
                  <description>ADC12 Clock Source Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIV</name>
              <description>ADC12 Clock Divider Select Bit: 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DIV_0</name>
                  <description>ADC12 Clock Divider Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_1</name>
                  <description>ADC12 Clock Divider Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_2</name>
                  <description>ADC12 Clock Divider Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_3</name>
                  <description>ADC12 Clock Divider Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_4</name>
                  <description>ADC12 Clock Divider Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_5</name>
                  <description>ADC12 Clock Divider Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_6</name>
                  <description>ADC12 Clock Divider Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_7</name>
                  <description>ADC12 Clock Divider Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ISSH</name>
              <description>ADC12 Invert Sample Hold Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SHP</name>
              <description>ADC12 Sample/Hold Pulse Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SHS</name>
              <description>ADC12 Sample/Hold Source Bit: 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHS_0</name>
                  <description>ADC12 Sample/Hold Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_1</name>
                  <description>ADC12 Sample/Hold Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_2</name>
                  <description>ADC12 Sample/Hold Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_3</name>
                  <description>ADC12 Sample/Hold Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12CSTARTADD</name>
              <description>ADC12 Conversion Start Address Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_0</name>
                  <description>ADC12 Conversion Start Address: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_1</name>
                  <description>ADC12 Conversion Start Address: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_2</name>
                  <description>ADC12 Conversion Start Address: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_3</name>
                  <description>ADC12 Conversion Start Address: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_4</name>
                  <description>ADC12 Conversion Start Address: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_5</name>
                  <description>ADC12 Conversion Start Address: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_6</name>
                  <description>ADC12 Conversion Start Address: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_7</name>
                  <description>ADC12 Conversion Start Address: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_8</name>
                  <description>ADC12 Conversion Start Address: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_9</name>
                  <description>ADC12 Conversion Start Address: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_10</name>
                  <description>ADC12 Conversion Start Address: 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_11</name>
                  <description>ADC12 Conversion Start Address: 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_12</name>
                  <description>ADC12 Conversion Start Address: 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_13</name>
                  <description>ADC12 Conversion Start Address: 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_14</name>
                  <description>ADC12 Conversion Start Address: 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_15</name>
                  <description>ADC12 Conversion Start Address: 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12CTL2</name>
          <description>ADC12+ Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12REFBURST</name>
              <description>ADC12+ Reference Burst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12REFOUT</name>
              <description>ADC12+ Reference Out</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SR</name>
              <description>ADC12+ Sampling Rate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12DF</name>
              <description>ADC12+ Data Format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12RES</name>
              <description>ADC12+ Resolution Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12RES_0</name>
                  <description>ADC12+ Resolution : 8 Bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_1</name>
                  <description>ADC12+ Resolution : 10 Bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_2</name>
                  <description>ADC12+ Resolution : 12 Bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_3</name>
                  <description>ADC12+ Resolution : reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12TCOFF</name>
              <description>ADC12+ Temperature Sensor Off</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12PDIV</name>
              <description>ADC12+ predivider 0:/1   1:/4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12IFG</name>
          <description>ADC12+ Interrupt Flag</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12IFG0</name>
              <description>ADC12 Memory 0 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG1</name>
              <description>ADC12 Memory 1 Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG2</name>
              <description>ADC12 Memory 2 Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG3</name>
              <description>ADC12 Memory 3 Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG4</name>
              <description>ADC12 Memory 4 Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG5</name>
              <description>ADC12 Memory 5 Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG6</name>
              <description>ADC12 Memory 6 Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG7</name>
              <description>ADC12 Memory 7 Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG8</name>
              <description>ADC12 Memory 8 Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG9</name>
              <description>ADC12 Memory 9 Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG10</name>
              <description>ADC12 Memory 10 Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG11</name>
              <description>ADC12 Memory 11 Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG12</name>
              <description>ADC12 Memory 12 Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG13</name>
              <description>ADC12 Memory 13 Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG14</name>
              <description>ADC12 Memory 14 Interrupt Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG15</name>
              <description>ADC12 Memory 15 Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADC12IE</name>
          <description>ADC12+ Interrupt Enable</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12IE0</name>
              <description>ADC12 Memory 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE1</name>
              <description>ADC12 Memory 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE2</name>
              <description>ADC12 Memory 2 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE3</name>
              <description>ADC12 Memory 3 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE4</name>
              <description>ADC12 Memory 4 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE5</name>
              <description>ADC12 Memory 5 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE6</name>
              <description>ADC12 Memory 6 Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE7</name>
              <description>ADC12 Memory 7 Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE8</name>
              <description>ADC12 Memory 8 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE9</name>
              <description>ADC12 Memory 9 Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE10</name>
              <description>ADC12 Memory 10 Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE11</name>
              <description>ADC12 Memory 11 Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE12</name>
              <description>ADC12 Memory 12 Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE13</name>
              <description>ADC12 Memory 13 Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE14</name>
              <description>ADC12 Memory 14 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IE15</name>
              <description>ADC12 Memory 15 Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADC12IV</name>
          <description>ADC12+ Interrupt Vector Word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM0</name>
          <description>ADC12 Conversion Memory 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
