cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>ADC12MEM1</name>
          <description>ADC12 Conversion Memory 1</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM2</name>
          <description>ADC12 Conversion Memory 2</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM3</name>
          <description>ADC12 Conversion Memory 3</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM4</name>
          <description>ADC12 Conversion Memory 4</description>
          <addressOffset>40</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM5</name>
          <description>ADC12 Conversion Memory 5</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM6</name>
          <description>ADC12 Conversion Memory 6</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM7</name>
          <description>ADC12 Conversion Memory 7</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM8</name>
          <description>ADC12 Conversion Memory 8</description>
          <addressOffset>48</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM9</name>
          <description>ADC12 Conversion Memory 9</description>
          <addressOffset>50</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM10</name>
          <description>ADC12 Conversion Memory 10</description>
          <addressOffset>52</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM11</name>
          <description>ADC12 Conversion Memory 11</description>
          <addressOffset>54</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM12</name>
          <description>ADC12 Conversion Memory 12</description>
          <addressOffset>56</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM13</name>
          <description>ADC12 Conversion Memory 13</description>
          <addressOffset>58</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM14</name>
          <description>ADC12 Conversion Memory 14</description>
          <addressOffset>60</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12MEM15</name>
          <description>ADC12 Conversion Memory 15</description>
          <addressOffset>62</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_CONTROL</name>
      <description>USB Control</description>
      <baseAddress>2304</baseAddress>
      <registers>
        <register>
          <name>USBIEPCNF_0</name>
          <description>USB Input endpoint_0: Configuration</description>
          <addressOffset>32</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPCNT_0</name>
          <description>USB Input endpoint_0: Byte Count</description>
          <addressOffset>33</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_0</name>
          <description>USB Output endpoint_0: Configuration</description>
          <addressOffset>34</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPCNT_0</name>
          <description>USB Output endpoint_0: byte count</description>
          <addressOffset>35</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPIE</name>
          <description>USB Input endpoint interrupt enable flags</description>
          <addressOffset>46</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPIE</name>
          <description>USB Output endpoint interrupt enable flags</description>
          <addressOffset>47</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPIFG</name>
          <description>USB Input endpoint interrupt flags</description>
          <addressOffset>48</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPIFG</name>
          <description>USB Output endpoint interrupt flags</description>
          <addressOffset>49</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBCTL</name>
          <description>USB control register</description>
          <addressOffset>60</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>DIR</name>
              <description>USB - Data Response Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRSTE</name>
              <description>USB - Function Reset Connection Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWUP</name>
              <description>USB - Device Remote Wakeup Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEN</name>
              <description>USB - Function Enable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIE</name>
          <description>USB interrupt enable register</description>
          <addressOffset>61</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>STPOWIE</name>
              <description>USB - Setup Overwrite Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPIE</name>
              <description>USB - Setup Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESRIE</name>
              <description>USB - Function Resume Request Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSRIE</name>
              <description>USB - Function Suspend Request Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTRIE</name>
              <description>USB - Function Reset Request Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIFG</name>
          <description>USB interrupt flag register</description>
          <addressOffset>62</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>STPOWIFG</name>
              <description>USB - Setup Overwrite Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETUPIFG</name>
              <description>USB - Setup Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESRIFG</name>
              <description>USB - Function Resume Request Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSRIFG</name>
              <description>USB - Function Suspend Request Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTRIFG</name>
              <description>USB - Function Reset Request Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFUNADR</name>
          <description>USB Function address register</description>
          <addressOffset>63</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBKEYID</name>
          <description>USB Controller key register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>USBCNF</name>
          <description>USB Module  configuration register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>USB_EN</name>
              <description>USB - Module enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUR_EN</name>
              <description>USB - PUR pin enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUR_IN</name>
              <description>USB - PUR pin input value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKRDY</name>
              <description>USB - Block ready signal for DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNTEN</name>
              <description>USB - Frame Number receive Trigger enable for DMA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHYCTL</name>
          <description>USB PHY control register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PUOUT0</name>
              <description>USB - USB Port Output Signal Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUOUT1</name>
              <description>USB - USB Port Output Signal Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUIN0</name>
              <description>USB - PU0/DP Input Data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUIN1</name>
              <description>USB - PU1/DM Input Data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUOPE</name>
              <description>USB - USB Port Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUSEL</name>
              <description>USB - USB Port Function Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUIPE</name>
              <description>USB - PHY Single Ended Input enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPWRCTL</name>
          <description>USB Power control register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>VUOVLIFG</name>
              <description>USB - VUSB Overload Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBONIFG</name>
              <description>USB - VBUS "Coming ON" Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBOFFIFG</name>
              <description>USB - VBUS "Going OFF" Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBBGVBV</name>
              <description>USB - USB Bandgap and VBUS valid</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBDETEN</name>
              <description>USB - VBUS on/off events enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVLAOFF</name>
              <description>USB - LDO overload auto off enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLDOAON</name>
              <description>USB - Secondary LDO auto on enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VUOVLIE</name>
              <description>USB - Overload indication Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBONIE</name>
              <description>USB - VBUS "Coming ON" Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBOFFIE</name>
              <description>USB - VBUS "Going OFF" Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VUSBEN</name>
              <description>USB - LDO Enable (3.3V)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLDOEN</name>
              <description>USB - Secondary LDO Enable (1.8V)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPLLCTL</name>
          <description>USB PLL control register</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCLKSEL</name>
              <description>USB - Module Clock Select Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLKSEL_0</name>
                  <description>USB - Module Clock Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLKSEL_1</name>
                  <description>USB - Module Clock Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLKSEL_2</name>
                  <description>USB - Module Clock Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLKSEL_3</name>
                  <description>USB - Module Clock Select: 3 (Reserved)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPLLEN</name>
              <description>USB - PLL enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPFDEN</name>
              <description>USB - Phase Freq. Discriminator enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
