cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>USBPLLDIVB</name>
          <description>USB PLL Clock Divider Buffer control register</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UPMB0</name>
              <description>USB - PLL feedback divider buffer Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPMB1</name>
              <description>USB - PLL feedback divider buffer Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPMB2</name>
              <description>USB - PLL feedback divider buffer Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPMB3</name>
              <description>USB - PLL feedback divider buffer Bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPMB4</name>
              <description>USB - PLL feedback divider buffer Bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPMB5</name>
              <description>USB - PLL feedback divider buffer Bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPQB0</name>
              <description>USB - PLL prescale divider buffer Bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPQB1</name>
              <description>USB - PLL prescale divider buffer Bit 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPQB2</name>
              <description>USB - PLL prescale divider buffer Bit 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPLLIR</name>
          <description>USB PLL Interrupt control register</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>USBOOLIFG</name>
              <description>USB - PLL out of lock Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBLOSIFG</name>
              <description>USB - PLL loss of signal Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBOORIFG</name>
              <description>USB - PLL out of range Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBOOLIE</name>
              <description>USB - PLL out of lock Interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBLOSIE</name>
              <description>USB - PLL loss of signal Interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBOORIE</name>
              <description>USB - PLL out of range Interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBVECINT</name>
          <description>USB Vector interrupt register</description>
          <addressOffset>50</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>USBMAINT</name>
          <description>USB maintenance register</description>
          <addressOffset>54</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UTIFG</name>
              <description>USB - Timer Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTIE</name>
              <description>USB - Timer Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSGEN</name>
              <description>USB - Time Stamp Generator Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSESEL</name>
              <description>USB - Time Stamp Event Select Bit 0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSESEL_0</name>
                  <description>USB - Time Stamp Event Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSESEL_1</name>
                  <description>USB - Time Stamp Event Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSESEL_2</name>
                  <description>USB - Time Stamp Event Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSESEL_3</name>
                  <description>USB - Time Stamp Event Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSE3</name>
              <description>USB - Time Stamp Event #3 Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTSEL</name>
              <description>USB - Timer Select Bit 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTSEL_0</name>
                  <description>USB - Timer Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_1</name>
                  <description>USB - Timer Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_2</name>
                  <description>USB - Timer Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_3</name>
                  <description>USB - Timer Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_4</name>
                  <description>USB - Timer Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_5</name>
                  <description>USB - Timer Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_6</name>
                  <description>USB - Timer Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTSEL_7</name>
                  <description>USB - Timer Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTSREG</name>
          <description>USB Time Stamp register</description>
          <addressOffset>56</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>USBFN</name>
          <description>USB Frame number</description>
          <addressOffset>58</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
