cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_OPERATION</name>
      <description>USB Operation</description>
      <baseAddress>7168</baseAddress>
      <registers>
        <register>
          <name>USBSTABUFF</name>
          <description>Start of buffer space</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBTOPBUFF</name>
          <description>Top of buffer space</description>
          <addressOffset>1903</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEP0BUF</name>
          <description>Output endpoint_0 buffer</description>
          <addressOffset>1904</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEP0BUF</name>
          <description>Input endpoint_0 buffer</description>
          <addressOffset>1912</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBSUBLK</name>
          <description>Setup Packet Block</description>
          <addressOffset>1920</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_1</name>
          <description>Output Endpoint_1: Configuration</description>
          <addressOffset>1928</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_1</name>
          <description>Output Endpoint_1: X-buffer base addr.</description>
          <addressOffset>1929</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_1</name>
          <description>Output Endpoint_1: X-byte count</description>
          <addressOffset>1930</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_1</name>
          <description>Output Endpoint_1: Y-buffer base addr.</description>
          <addressOffset>1933</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_1</name>
          <description>Output Endpoint_1: Y-byte count</description>
          <addressOffset>1934</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_1</name>
          <description>Output Endpoint_1: X/Y-buffer size</description>
          <addressOffset>1935</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_2</name>
          <description>Output Endpoint_2: Configuration</description>
          <addressOffset>1936</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_2</name>
          <description>Output Endpoint_2: X-buffer base addr.</description>
          <addressOffset>1937</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_2</name>
          <description>Output Endpoint_2: X-byte count</description>
          <addressOffset>1938</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_2</name>
          <description>Output Endpoint_2: Y-buffer base addr.</description>
          <addressOffset>1941</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_2</name>
          <description>Output Endpoint_2: Y-byte count</description>
          <addressOffset>1942</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_2</name>
          <description>Output Endpoint_2: X/Y-buffer size</description>
          <addressOffset>1943</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_3</name>
          <description>Output Endpoint_3: Configuration</description>
          <addressOffset>1944</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_3</name>
          <description>Output Endpoint_3: X-buffer base addr.</description>
          <addressOffset>1945</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_3</name>
          <description>Output Endpoint_3: X-byte count</description>
          <addressOffset>1946</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_3</name>
          <description>Output Endpoint_3: Y-buffer base addr.</description>
          <addressOffset>1949</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_3</name>
          <description>Output Endpoint_3: Y-byte count</description>
          <addressOffset>1950</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_3</name>
          <description>Output Endpoint_3: X/Y-buffer size</description>
          <addressOffset>1951</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_4</name>
          <description>Output Endpoint_4: Configuration</description>
          <addressOffset>1952</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_4</name>
          <description>Output Endpoint_4: X-buffer base addr.</description>
          <addressOffset>1953</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_4</name>
          <description>Output Endpoint_4: X-byte count</description>
          <addressOffset>1954</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_4</name>
          <description>Output Endpoint_4: Y-buffer base addr.</description>
          <addressOffset>1957</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_4</name>
          <description>Output Endpoint_4: Y-byte count</description>
          <addressOffset>1958</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_4</name>
          <description>Output Endpoint_4: X/Y-buffer size</description>
          <addressOffset>1959</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_5</name>
          <description>Output Endpoint_5: Configuration</description>
          <addressOffset>1960</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_5</name>
          <description>Output Endpoint_5: X-buffer base addr.</description>
          <addressOffset>1961</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_5</name>
          <description>Output Endpoint_5: X-byte count</description>
          <addressOffset>1962</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_5</name>
          <description>Output Endpoint_5: Y-buffer base addr.</description>
          <addressOffset>1965</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_5</name>
          <description>Output Endpoint_5: Y-byte count</description>
          <addressOffset>1966</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_5</name>
          <description>Output Endpoint_5: X/Y-buffer size</description>
          <addressOffset>1967</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_6</name>
          <description>Output Endpoint_6: Configuration</description>
          <addressOffset>1968</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_6</name>
          <description>Output Endpoint_6: X-buffer base addr.</description>
          <addressOffset>1969</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_6</name>
          <description>Output Endpoint_6: X-byte count</description>
          <addressOffset>1970</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_6</name>
          <description>Output Endpoint_6: Y-buffer base addr.</description>
          <addressOffset>1973</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_6</name>
          <description>Output Endpoint_6: Y-byte count</description>
          <addressOffset>1974</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_6</name>
          <description>Output Endpoint_6: X/Y-buffer size</description>
          <addressOffset>1975</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPCNF_7</name>
          <description>Output Endpoint_7: Configuration</description>
          <addressOffset>1976</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOEPBBAX_7</name>
          <description>Output Endpoint_7: X-buffer base addr.</description>
          <addressOffset>1977</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTX_7</name>
          <description>Output Endpoint_7: X-byte count</description>
          <addressOffset>1978</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBBAY_7</name>
          <description>Output Endpoint_7: Y-buffer base addr.</description>
          <addressOffset>1981</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPBCTY_7</name>
          <description>Output Endpoint_7: Y-byte count</description>
          <addressOffset>1982</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBOEPSIZXY_7</name>
          <description>Output Endpoint_7: X/Y-buffer size</description>
          <addressOffset>1983</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_1</name>
          <description>Input Endpoint_1: Configuration</description>
          <addressOffset>1992</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_1</name>
          <description>Input Endpoint_1: X-buffer base addr.</description>
          <addressOffset>1993</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_1</name>
          <description>Input Endpoint_1: X-byte count</description>
          <addressOffset>1994</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_1</name>
          <description>Input Endpoint_1: Y-buffer base addr.</description>
          <addressOffset>1997</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
