cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>USBIEPBCTY_1</name>
          <description>Input Endpoint_1: Y-byte count</description>
          <addressOffset>1998</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_1</name>
          <description>Input Endpoint_1: X/Y-buffer size</description>
          <addressOffset>1999</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_2</name>
          <description>Input Endpoint_2: Configuration</description>
          <addressOffset>2000</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_2</name>
          <description>Input Endpoint_2: X-buffer base addr.</description>
          <addressOffset>2001</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_2</name>
          <description>Input Endpoint_2: X-byte count</description>
          <addressOffset>2002</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_2</name>
          <description>Input Endpoint_2: Y-buffer base addr.</description>
          <addressOffset>2005</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_2</name>
          <description>Input Endpoint_2: Y-byte count</description>
          <addressOffset>2006</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_2</name>
          <description>Input Endpoint_2: X/Y-buffer size</description>
          <addressOffset>2007</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_3</name>
          <description>Input Endpoint_3: Configuration</description>
          <addressOffset>2008</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_3</name>
          <description>Input Endpoint_3: X-buffer base addr.</description>
          <addressOffset>2009</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_3</name>
          <description>Input Endpoint_3: X-byte count</description>
          <addressOffset>2010</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_3</name>
          <description>Input Endpoint_3: Y-buffer base addr.</description>
          <addressOffset>2013</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_3</name>
          <description>Input Endpoint_3: Y-byte count</description>
          <addressOffset>2014</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_3</name>
          <description>Input Endpoint_3: X/Y-buffer size</description>
          <addressOffset>2015</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_4</name>
          <description>Input Endpoint_4: Configuration</description>
          <addressOffset>2016</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_4</name>
          <description>Input Endpoint_4: X-buffer base addr.</description>
          <addressOffset>2017</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_4</name>
          <description>Input Endpoint_4: X-byte count</description>
          <addressOffset>2018</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_4</name>
          <description>Input Endpoint_4: Y-buffer base addr.</description>
          <addressOffset>2021</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_4</name>
          <description>Input Endpoint_4: Y-byte count</description>
          <addressOffset>2022</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_4</name>
          <description>Input Endpoint_4: X/Y-buffer size</description>
          <addressOffset>2023</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_5</name>
          <description>Input Endpoint_5: Configuration</description>
          <addressOffset>2024</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_5</name>
          <description>Input Endpoint_5: X-buffer base addr.</description>
          <addressOffset>2025</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_5</name>
          <description>Input Endpoint_5: X-byte count</description>
          <addressOffset>2026</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_5</name>
          <description>Input Endpoint_5: Y-buffer base addr.</description>
          <addressOffset>2029</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_5</name>
          <description>Input Endpoint_5: Y-byte count</description>
          <addressOffset>2030</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_5</name>
          <description>Input Endpoint_5: X/Y-buffer size</description>
          <addressOffset>2031</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_6</name>
          <description>Input Endpoint_6: Configuration</description>
          <addressOffset>2032</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_6</name>
          <description>Input Endpoint_6: X-buffer base addr.</description>
          <addressOffset>2033</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_6</name>
          <description>Input Endpoint_6: X-byte count</description>
          <addressOffset>2034</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_6</name>
          <description>Input Endpoint_6: Y-buffer base addr.</description>
          <addressOffset>2037</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_6</name>
          <description>Input Endpoint_6: Y-byte count</description>
          <addressOffset>2038</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_6</name>
          <description>Input Endpoint_6: X/Y-buffer size</description>
          <addressOffset>2039</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPCNF_7</name>
          <description>Input Endpoint_7: Configuration</description>
          <addressOffset>2040</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>USBIIE</name>
              <description>USB - Transaction Interrupt indication enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>USB - Stall Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF</name>
              <description>USB - Double Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOGGLE</name>
              <description>USB - Toggle Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBME</name>
              <description>USB - UBM In-Endpoint Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIEPBBAX_7</name>
          <description>Input Endpoint_7: X-buffer base addr.</description>
          <addressOffset>2041</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTX_7</name>
          <description>Input Endpoint_7: X-byte count</description>
          <addressOffset>2042</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBBAY_7</name>
          <description>Input Endpoint_7: Y-buffer base addr.</description>
          <addressOffset>2045</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPBCTY_7</name>
          <description>Input Endpoint_7: Y-byte count</description>
          <addressOffset>2046</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>USBIEPSIZXY_7</name>
          <description>Input Endpoint_7: X/Y-buffer size</description>
          <addressOffset>2047</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
