cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SFR</name>
      <description>SFR  Special Function Registers</description>
      <baseAddress>256</baseAddress>
      <registers>
        <register>
          <name>SFRIE1</name>
          <description>Interrupt Enable 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIE</name>
              <description>WDT Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFIE</name>
              <description>Osc Fault Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VMAIE</name>
              <description>Vacant Memory Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIIE</name>
              <description>NMI Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCVIE</name>
              <description>Flash Access Violation Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBINIE</name>
              <description>JTAG Mail Box input Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUTIE</name>
              <description>JTAG Mail Box output Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFRIFG1</name>
          <description>Interrupt Flag 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIFG</name>
              <description>WDT Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFIFG</name>
              <description>Osc Fault Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VMAIFG</name>
              <description>Vacant Memory Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIIFG</name>
              <description>NMI Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBINIFG</name>
              <description>JTAG Mail Box input Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUTIFG</name>
              <description>JTAG Mail Box output Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFRRPCR</name>
          <description>RESET Pin Control Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSNMI</name>
              <description>NMI select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSNMIIES</name>
              <description>NMI edge select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRSTUP</name>
              <description>RESET Pin pull down/up select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRSTRE</name>
              <description>RESET Pin Resistor enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMM</name>
      <description>PMM  Power Management System</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>PMMCTL0</name>
          <description>PMM Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PMMCOREV</name>
              <description>PMM Core Voltage Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMCOREV_0</name>
                  <description>PMM Core Voltage 0 (1.35V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMCOREV_1</name>
                  <description>PMM Core Voltage 1 (1.55V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMCOREV_2</name>
                  <description>PMM Core Voltage 2 (1.75V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMCOREV_3</name>
                  <description>PMM Core Voltage 3 (1.85V)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMSWBOR</name>
              <description>PMM Software BOR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMSWPOR</name>
              <description>PMM Software POR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMREGOFF</name>
              <description>PMM Turn Regulator off</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMHPMRE</name>
              <description>PMM Global High Power Module Request Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMCTL1</name>
          <description>PMM Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PMMREFMD</name>
              <description>PMM Reference Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMCMD0</name>
              <description>PMM Voltage Regulator Current Mode Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMCMD1</name>
              <description>PMM Voltage Regulator Current Mode Bit: 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SVSMHCTL</name>
          <description>SVS and SVM high side control register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SVSMHRRL</name>
              <description>SVS and SVM high side Reset Release Voltage Level Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSMHRRL_0</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_1</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_2</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_3</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_4</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_5</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_6</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMHRRL_7</name>
                  <description>SVS and SVM high side Reset Release Voltage Level 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSMHDLYST</name>
              <description>SVS and SVM high side delay status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSHMD</name>
              <description>SVS high side mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSMHEVM</name>
              <description>SVS and SVM high side event mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSMHACE</name>
              <description>SVS and SVM high side auto control enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSHRVL</name>
              <description>SVS high side reset voltage level Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSHRVL_0</name>
                  <description>SVS high side Reset Release Voltage Level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHRVL_1</name>
                  <description>SVS high side Reset Release Voltage Level 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHRVL_2</name>
                  <description>SVS high side Reset Release Voltage Level 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHRVL_3</name>
                  <description>SVS high side Reset Release Voltage Level 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSHE</name>
              <description>SVS high side enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSHFP</name>
              <description>SVS high side full performace mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMHOVPE</name>
              <description>SVM high side over-voltage enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMHE</name>
              <description>SVM high side enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMHFP</name>
              <description>SVM high side full performace mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SVSMLCTL</name>
          <description>SVS and SVM low side control register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SVSMLRRL</name>
              <description>SVS and SVM low side Reset Release Voltage Level Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSMLRRL_0</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_1</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_2</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_3</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_4</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_5</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_6</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSMLRRL_7</name>
                  <description>SVS and SVM low side Reset Release Voltage Level 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSMLDLYST</name>
              <description>SVS and SVM low side delay status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSLMD</name>
              <description>SVS low side mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSMLEVM</name>
              <description>SVS and SVM low side event mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSMLACE</name>
              <description>SVS and SVM low side auto control enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSLRVL</name>
              <description>SVS low side reset voltage level Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSLRVL_0</name>
                  <description>SVS low side Reset Release Voltage Level 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSLRVL_1</name>
                  <description>SVS low side Reset Release Voltage Level 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSLRVL_2</name>
                  <description>SVS low side Reset Release Voltage Level 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSLRVL_3</name>
                  <description>SVS low side Reset Release Voltage Level 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSLE</name>
              <description>SVS low side enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSLFP</name>
              <description>SVS low side full performace mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMLOVPE</name>
              <description>SVM low side over-voltage enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMLE</name>
              <description>SVM low side enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMLFP</name>
              <description>SVM low side full performace mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SVSMIO</name>
          <description>SVSIN and SVSOUT control register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SVMLOE</name>
              <description>SVM low side output enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMLVLROE</name>
              <description>SVM low side voltage level reached output enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMOUTPOL</name>
              <description>SVMOUT pin polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMHOE</name>
              <description>SVM high side output enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVMHVLROE</name>
              <description>SVM high side voltage level reached output enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
