cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UCS</name>
      <description>UCS  Unified System Clock</description>
      <baseAddress>352</baseAddress>
      <registers>
        <register>
          <name>UCSCTL0</name>
          <description>UCS Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MOD0</name>
              <description>Modulation Bit Counter Bit : 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD1</name>
              <description>Modulation Bit Counter Bit : 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD2</name>
              <description>Modulation Bit Counter Bit : 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD3</name>
              <description>Modulation Bit Counter Bit : 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD4</name>
              <description>Modulation Bit Counter Bit : 4</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO0</name>
              <description>DCO TAP Bit : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO1</name>
              <description>DCO TAP Bit : 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO2</name>
              <description>DCO TAP Bit : 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO3</name>
              <description>DCO TAP Bit : 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO4</name>
              <description>DCO TAP Bit : 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL1</name>
          <description>UCS Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>Disable Modulation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>DCO Freq. Range Select Bit : 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCORSEL_0</name>
                  <description>DCO RSEL 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_1</name>
                  <description>DCO RSEL 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_2</name>
                  <description>DCO RSEL 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_3</name>
                  <description>DCO RSEL 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_4</name>
                  <description>DCO RSEL 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_5</name>
                  <description>DCO RSEL 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_6</name>
                  <description>DCO RSEL 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_7</name>
                  <description>DCO RSEL 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL2</name>
          <description>UCS Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLN0</name>
              <description>FLL Multipier Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN1</name>
              <description>FLL Multipier Bit : 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN2</name>
              <description>FLL Multipier Bit : 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN3</name>
              <description>FLL Multipier Bit : 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN4</name>
              <description>FLL Multipier Bit : 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN5</name>
              <description>FLL Multipier Bit : 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN6</name>
              <description>FLL Multipier Bit : 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN7</name>
              <description>FLL Multipier Bit : 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN8</name>
              <description>FLL Multipier Bit : 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN9</name>
              <description>FLL Multipier Bit : 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLD</name>
              <description>Loop Divider Bit : 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLD_0</name>
                  <description>Multiply Selected Loop Freq. 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_1</name>
                  <description>Multiply Selected Loop Freq. 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_2</name>
                  <description>Multiply Selected Loop Freq. 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_3</name>
                  <description>Multiply Selected Loop Freq. 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_4</name>
                  <description>Multiply Selected Loop Freq. 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_5</name>
                  <description>Multiply Selected Loop Freq. 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_6</name>
                  <description>Multiply Selected Loop Freq. 32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_7</name>
                  <description>Multiply Selected Loop Freq. 32</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL3</name>
          <description>UCS Control Register 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLREFDIV</name>
              <description>Reference Divider Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLREFDIV_0</name>
                  <description>Reference Divider: f(LFCLK)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_1</name>
                  <description>Reference Divider: f(LFCLK)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_2</name>
                  <description>Reference Divider: f(LFCLK)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_3</name>
                  <description>Reference Divider: f(LFCLK)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_4</name>
                  <description>Reference Divider: f(LFCLK)/12</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_5</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_6</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_7</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELREF</name>
              <description>FLL Reference Clock Select Bit : 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_0</name>
                  <description>FLL Reference Clock Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_1</name>
                  <description>FLL Reference Clock Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_2</name>
                  <description>FLL Reference Clock Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_3</name>
                  <description>FLL Reference Clock Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_4</name>
                  <description>FLL Reference Clock Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_5</name>
                  <description>FLL Reference Clock Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_6</name>
                  <description>FLL Reference Clock Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_7</name>
                  <description>FLL Reference Clock Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL4</name>
          <description>UCS Control Register 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SELM</name>
              <description>MCLK Source Select Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELM_0</name>
                  <description>MCLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_1</name>
                  <description>MCLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_2</name>
                  <description>MCLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_3</name>
                  <description>MCLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_4</name>
                  <description>MCLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_5</name>
                  <description>MCLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_6</name>
                  <description>MCLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_7</name>
                  <description>MCLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELS</name>
              <description>SMCLK Source Select Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELS_0</name>
                  <description>SMCLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_1</name>
                  <description>SMCLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_2</name>
                  <description>SMCLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_3</name>
                  <description>SMCLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_4</name>
                  <description>SMCLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_5</name>
                  <description>SMCLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_6</name>
                  <description>SMCLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_7</name>
                  <description>SMCLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>ACLK Source Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELA_0</name>
                  <description>ACLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_1</name>
                  <description>ACLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_2</name>
                  <description>ACLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_3</name>
                  <description>ACLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_4</name>
                  <description>ACLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_5</name>
                  <description>ACLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_6</name>
                  <description>ACLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_7</name>
                  <description>ACLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
