cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>UCSCTL5</name>
          <description>UCS Control Register 5</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DIVM</name>
              <description>MCLK Divider Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVM_0</name>
                  <description>MCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_1</name>
                  <description>MCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_2</name>
                  <description>MCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_3</name>
                  <description>MCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_4</name>
                  <description>MCLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_5</name>
                  <description>MCLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_6</name>
                  <description>MCLK Source Divider 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_7</name>
                  <description>MCLK Source Divider 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>SMCLK Divider Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVS_0</name>
                  <description>SMCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_1</name>
                  <description>SMCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_2</name>
                  <description>SMCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_3</name>
                  <description>SMCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_4</name>
                  <description>SMCLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_5</name>
                  <description>SMCLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_6</name>
                  <description>SMCLK Source Divider 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_7</name>
                  <description>SMCLK Source Divider 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVA</name>
              <description>ACLK Divider Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVA_0</name>
                  <description>ACLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_1</name>
                  <description>ACLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_2</name>
                  <description>ACLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_3</name>
                  <description>ACLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_4</name>
                  <description>ACLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_5</name>
                  <description>ACLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_6</name>
                  <description>ACLK Source Divider 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_7</name>
                  <description>ACLK Source Divider 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVPA</name>
              <description>ACLK from Pin Divider Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVPA_0</name>
                  <description>ACLK from Pin Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_1</name>
                  <description>ACLK from Pin Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_2</name>
                  <description>ACLK from Pin Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_3</name>
                  <description>ACLK from Pin Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_4</name>
                  <description>ACLK from Pin Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_5</name>
                  <description>ACLK from Pin Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_6</name>
                  <description>ACLK from Pin Source Divider 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVPA_7</name>
                  <description>ACLK from Pin Source Divider 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL6</name>
          <description>UCS Control Register 6</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>XT1OFF</name>
              <description>High Frequency Oscillator 1 (XT1) disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>SMCLK Off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCAP</name>
              <description>XIN/XOUT Cap Bit: 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCAP_0</name>
                  <description>XIN/XOUT Cap 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCAP_1</name>
                  <description>XIN/XOUT Cap 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCAP_2</name>
                  <description>XIN/XOUT Cap 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCAP_3</name>
                  <description>XIN/XOUT Cap 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1BYPASS</name>
              <description>XT1 bypass mode : 0: internal 1:sourced from external pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTS</name>
              <description>1: Selects high-freq. oscillator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1DRIVE</name>
              <description>XT1 Drive Level mode Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1DRIVE_0</name>
                  <description>XT1 Drive Level mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_1</name>
                  <description>XT1 Drive Level mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_2</name>
                  <description>XT1 Drive Level mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_3</name>
                  <description>XT1 Drive Level mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT2OFF</name>
              <description>High Frequency Oscillator 2 (XT2) disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT2BYPASS</name>
              <description>XT2 bypass mode : 0: internal 1:sourced from external pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT2DRIVE</name>
              <description>XT2 Drive Level mode Bit 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT2DRIVE_0</name>
                  <description>XT2 Drive Level mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_1</name>
                  <description>XT2 Drive Level mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_2</name>
                  <description>XT2 Drive Level mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT2DRIVE_3</name>
                  <description>XT2 Drive Level mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL7</name>
          <description>UCS Control Register 7</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DCOFFG</name>
              <description>DCO Fault Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1LFOFFG</name>
              <description>XT1 Low Frequency Oscillator Fault Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT2OFFG</name>
              <description>High Frequency Oscillator 2 Fault Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSCTL8</name>
          <description>UCS Control Register 8</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>ACLK Clock Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>MCLK Clock Request Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>SMCLK Clock Request Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODOSCREQEN</name>
              <description>MODOSC Clock Request Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
