cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>SYS  System Module</description>
      <baseAddress>384</baseAddress>
      <registers>
        <register>
          <name>SYSCTL</name>
          <description>System control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>SYS - RAM based interrupt vectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>SYS - PMM access protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>SYS - TCK/RST indication detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>SYS - Dedicated JTAG pins enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSBSLC</name>
          <description>Boot strap configuration area</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSBSLSIZE0</name>
              <description>SYS - BSL Protection Size 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLSIZE1</name>
              <description>SYS - BSL Protection Size 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLR</name>
              <description>SYS - RAM assigned to BSL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLOFF</name>
              <description>SYS - BSL Memory disabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLPE</name>
              <description>SYS - BSL Memory protection enabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBC</name>
          <description>JTAG mailbox control</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>SYS - Outgoing JTAG Mailbox 0 Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>SYS - Outgoing JTAG Mailbox 1 Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>SYS - JMB 16/32 Bit Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <description>JTAG mailbox input 0</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <description>JTAG mailbox input 1</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <description>JTAG mailbox output 0</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <description>JTAG mailbox output 1</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSBERRIV</name>
          <description>Bus Error vector generator</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSUNIV</name>
          <description>User NMI vector generator</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSSNIV</name>
          <description>System NMI vector generator</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <description>Reset vector generator</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
