cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHARED_REFERENCE</name>
      <description>Shared Reference</description>
      <baseAddress>432</baseAddress>
      <registers>
        <register>
          <name>REFCTL0</name>
          <description>REF Shared Reference control register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>REFON</name>
              <description>REF Reference On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFOUT</name>
              <description>REF Reference output Buffer On</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTCOFF</name>
              <description>REF Temp.Sensor off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>REF Reference Voltage Level Select Bit:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFVSEL_0</name>
                  <description>REF Reference Voltage Level Select 1.5V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_1</name>
                  <description>REF Reference Voltage Level Select 2.0V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_2</name>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_3</name>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFMSTR</name>
              <description>REF Master Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFGENACT</name>
              <description>REF Reference generator active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBGACT</name>
              <description>REF Reference bandgap active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFGENBUSY</name>
              <description>REF Reference generator busy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGMODE</name>
              <description>REF Bandgap mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT_MAPPING_CONTROL</name>
      <description>Port Mapping Control</description>
      <baseAddress>448</baseAddress>
      <registers>
        <register>
          <name>PMAPKEYID</name>
          <description>Port Mapping Key register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PMAPCTL</name>
          <description>Port Mapping control register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PMAPLOCKED</name>
              <description>Port Mapping Lock bit. Read only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMAPRECFG</name>
              <description>Port Mapping re-configuration control bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT_J</name>
      <description>Port J</description>
      <baseAddress>800</baseAddress>
      <registers>
        <register>
          <name>PJIN</name>
          <description>Port J Input</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PJIN0</name>
              <description>PJIN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJIN1</name>
              <description>PJIN1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJIN2</name>
              <description>PJIN2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJIN3</name>
              <description>PJIN3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PJOUT</name>
          <description>Port J Output</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PJOUT0</name>
              <description>PJOUT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJOUT1</name>
              <description>PJOUT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJOUT2</name>
              <description>PJOUT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJOUT3</name>
              <description>PJOUT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PJDIR</name>
          <description>Port J Direction</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PJDIR0</name>
              <description>PJDIR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDIR1</name>
              <description>PJDIR1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDIR2</name>
              <description>PJDIR2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDIR3</name>
              <description>PJDIR3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PJREN</name>
          <description>Port J Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PJREN0</name>
              <description>PJREN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJREN1</name>
              <description>PJREN1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJREN2</name>
              <description>PJREN2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJREN3</name>
              <description>PJREN3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PJDS</name>
          <description>Port J Drive Strenght</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PJDS0</name>
              <description>PJDS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDS1</name>
              <description>PJDS1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDS2</name>
              <description>PJDS2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PJDS3</name>
              <description>PJDS3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
