cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_16</name>
      <description>MPY 16  Multiplier  16 Bit Mode</description>
      <baseAddress>1216</baseAddress>
      <registers>
        <register>
          <name>MPY</name>
          <description>Multiply Unsigned/Operand 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS</name>
          <description>Multiply Signed/Operand 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC</name>
          <description>Multiply Unsigned and Accumulate/Operand 1</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS</name>
          <description>Multiply Signed and Accumulate/Operand 1</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2</name>
          <description>Operand 2</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESLO</name>
          <description>Result Low Word</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESHI</name>
          <description>Result High Word</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SUMEXT</name>
          <description>Sum Extend</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32CTL0</name>
          <description>MPY32 Control Register 0</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPYC</name>
              <description>Carry of the multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYFRAC</name>
              <description>Fractional mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYSAT</name>
              <description>Saturation mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYM</name>
              <description>Multiplier mode Bit:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYM_0</name>
                  <description>Multiplier mode: MPY</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_1</name>
                  <description>Multiplier mode: MPYS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_2</name>
                  <description>Multiplier mode: MAC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_3</name>
                  <description>Multiplier mode: MACS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OP1_32</name>
              <description>Bit-width of operand 1 0:16Bit / 1:32Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_32</name>
              <description>Bit-width of operand 2 0:16Bit / 1:32Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYDLYWRTEN</name>
              <description>Delayed write enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYDLY32</name>
              <description>Delayed write mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_32</name>
      <description>MPY 32  Multiplier  32 Bit Mode</description>
      <baseAddress>1232</baseAddress>
      <registers>
        <register>
          <name>MPY32L</name>
          <description>32-bit operand 1 - multiply - low word</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32H</name>
          <description>32-bit operand 1 - multiply - high word</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32L</name>
          <description>32-bit operand 1 - signed multiply - low word</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32H</name>
          <description>32-bit operand 1 - signed multiply - high word</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32L</name>
          <description>32-bit operand 1 - multiply accumulate - low word</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32H</name>
          <description>32-bit operand 1 - multiply accumulate - high word</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32L</name>
          <description>32-bit operand 1 - signed multiply accumulate - low word</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32H</name>
          <description>32-bit operand 1 - signed multiply accumulate - high word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2L</name>
          <description>32-bit operand 2 - low word</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2H</name>
          <description>32-bit operand 2 - high word</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES0</name>
          <description>32x32-bit result 0 - least significant word</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES1</name>
          <description>32x32-bit result 1</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES2</name>
          <description>32x32-bit result 2</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES3</name>
          <description>32x32-bit result 3 - most significant word</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
