cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA</description>
      <baseAddress>1280</baseAddress>
      <registers>
        <register>
          <name>DMACTL0</name>
          <description>DMA Module Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMA0TSEL</name>
              <description>DMA channel 0 transfer select bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA0TSEL_0</name>
                  <description>DMA channel 0 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_1</name>
                  <description>DMA channel 0 transfer select 1:  Timer0_A (TA0CCR0.IFG)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_2</name>
                  <description>DMA channel 0 transfer select 2:  Timer0_A (TA0CCR2.IFG)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_3</name>
                  <description>DMA channel 0 transfer select 3:  Timer1_A (TA1CCR0.IFG)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_4</name>
                  <description>DMA channel 0 transfer select 4:  Timer1_A (TA1CCR2.IFG)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_5</name>
                  <description>DMA channel 0 transfer select 5:  Timer2_A (TA2CCR0.IFG)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_6</name>
                  <description>DMA channel 0 transfer select 6:  Timer2_A (TA2CCR2.IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_7</name>
                  <description>DMA channel 0 transfer select 7:  TimerB (TB0CCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_8</name>
                  <description>DMA channel 0 transfer select 8:  TimerB (TB0CCR2.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_9</name>
                  <description>DMA channel 0 transfer select 9:  Reserved</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_10</name>
                  <description>DMA channel 0 transfer select 10: Reserved</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_11</name>
                  <description>DMA channel 0 transfer select 11: Reserved</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_12</name>
                  <description>DMA channel 0 transfer select 12: Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_13</name>
                  <description>DMA channel 0 transfer select 13: Reserved</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_14</name>
                  <description>DMA channel 0 transfer select 14: Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_15</name>
                  <description>DMA channel 0 transfer select 15: Reserved</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_16</name>
                  <description>DMA channel 0 transfer select 16: USCIA0 receive</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_17</name>
                  <description>DMA channel 0 transfer select 17: USCIA0 transmit</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_18</name>
                  <description>DMA channel 0 transfer select 18: USCIB0 receive</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_19</name>
                  <description>DMA channel 0 transfer select 19: USCIB0 transmit</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_20</name>
                  <description>DMA channel 0 transfer select 20: USCIA1 receive</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_21</name>
                  <description>DMA channel 0 transfer select 21: USCIA1 transmit</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_22</name>
                  <description>DMA channel 0 transfer select 22: USCIB1 receive</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_23</name>
                  <description>DMA channel 0 transfer select 23: USCIB1 transmit</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_24</name>
                  <description>DMA channel 0 transfer select 24: ADC12IFGx</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_25</name>
                  <description>DMA channel 0 transfer select 25: Reserved</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_26</name>
                  <description>DMA channel 0 transfer select 26: Reserved</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_27</name>
                  <description>DMA channel 0 transfer select 27: USB FNRXD</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_28</name>
                  <description>DMA channel 0 transfer select 28: USB ready</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_29</name>
                  <description>DMA channel 0 transfer select 29: Multiplier ready</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_30</name>
                  <description>DMA channel 0 transfer select 30: previous DMA channel DMA2IFG</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_31</name>
                  <description>DMA channel 0 transfer select 31: ext. Trigger (DMAE0)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1TSEL</name>
              <description>DMA channel 1 transfer select bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA1TSEL_0</name>
                  <description>DMA channel 1 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_1</name>
                  <description>DMA channel 1 transfer select 1:  Timer0_A (TA0CCR0.IFG)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_2</name>
                  <description>DMA channel 1 transfer select 2:  Timer0_A (TA0CCR2.IFG)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_3</name>
                  <description>DMA channel 1 transfer select 3:  Timer1_A (TA1CCR0.IFG)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_4</name>
                  <description>DMA channel 1 transfer select 4:  Timer1_A (TA1CCR2.IFG)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_5</name>
                  <description>DMA channel 1 transfer select 5:  Timer2_A (TA2CCR0.IFG)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_6</name>
                  <description>DMA channel 1 transfer select 6:  Timer2_A (TA2CCR2.IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_7</name>
                  <description>DMA channel 1 transfer select 7:  TimerB (TB0CCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_8</name>
                  <description>DMA channel 1 transfer select 8:  TimerB (TB0CCR2.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_9</name>
                  <description>DMA channel 1 transfer select 9:  Reserved</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_10</name>
                  <description>DMA channel 1 transfer select 10: Reserved</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_11</name>
                  <description>DMA channel 1 transfer select 11: Reserved</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_12</name>
                  <description>DMA channel 1 transfer select 12: Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_13</name>
                  <description>DMA channel 1 transfer select 13: Reserved</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_14</name>
                  <description>DMA channel 1 transfer select 14: Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_15</name>
                  <description>DMA channel 1 transfer select 15: Reserved</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_16</name>
                  <description>DMA channel 1 transfer select 16: USCIA0 receive</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_17</name>
                  <description>DMA channel 1 transfer select 17: USCIA0 transmit</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_18</name>
                  <description>DMA channel 1 transfer select 18: USCIB0 receive</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_19</name>
                  <description>DMA channel 1 transfer select 19: USCIB0 transmit</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_20</name>
                  <description>DMA channel 1 transfer select 20: USCIA1 receive</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_21</name>
                  <description>DMA channel 1 transfer select 21: USCIA1 transmit</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_22</name>
                  <description>DMA channel 1 transfer select 22: USCIB1 receive</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_23</name>
                  <description>DMA channel 1 transfer select 23: USCIB1 transmit</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_24</name>
                  <description>DMA channel 1 transfer select 24: ADC12IFGx</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_25</name>
                  <description>DMA channel 1 transfer select 25: Reserved</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_26</name>
                  <description>DMA channel 1 transfer select 26: Reserved</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_27</name>
                  <description>DMA channel 1 transfer select 27: USB FNRXD</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_28</name>
                  <description>DMA channel 1 transfer select 28: USB ready</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_29</name>
                  <description>DMA channel 1 transfer select 29: Multiplier ready</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_30</name>
                  <description>DMA channel 1 transfer select 30: previous DMA channel DMA0IFG</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_31</name>
                  <description>DMA channel 1 transfer select 31: ext. Trigger (DMAE0)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
