cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>DMACTL1</name>
          <description>DMA Module Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMA2TSEL</name>
              <description>DMA channel 2 transfer select bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA2TSEL_0</name>
                  <description>DMA channel 2 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_1</name>
                  <description>DMA channel 2 transfer select 1:  Timer0_A (TA0CCR0.IFG)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_2</name>
                  <description>DMA channel 2 transfer select 2:  Timer0_A (TA0CCR2.IFG)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_3</name>
                  <description>DMA channel 2 transfer select 3:  Timer1_A (TA1CCR0.IFG)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_4</name>
                  <description>DMA channel 2 transfer select 4:  Timer1_A (TA1CCR2.IFG)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_5</name>
                  <description>DMA channel 2 transfer select 5:  Timer2_A (TA2CCR0.IFG)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_6</name>
                  <description>DMA channel 2 transfer select 6:  Timer2_A (TA2CCR2.IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_7</name>
                  <description>DMA channel 2 transfer select 7:  TimerB (TB0CCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_8</name>
                  <description>DMA channel 2 transfer select 8:  TimerB (TB0CCR2.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_9</name>
                  <description>DMA channel 2 transfer select 9:  Reserved</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_10</name>
                  <description>DMA channel 2 transfer select 10: Reserved</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_11</name>
                  <description>DMA channel 2 transfer select 11: Reserved</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_12</name>
                  <description>DMA channel 2 transfer select 12: Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_13</name>
                  <description>DMA channel 2 transfer select 13: Reserved</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_14</name>
                  <description>DMA channel 2 transfer select 14: Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_15</name>
                  <description>DMA channel 2 transfer select 15: Reserved</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_16</name>
                  <description>DMA channel 2 transfer select 16: USCIA0 receive</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_17</name>
                  <description>DMA channel 2 transfer select 17: USCIA0 transmit</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_18</name>
                  <description>DMA channel 2 transfer select 18: USCIB0 receive</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_19</name>
                  <description>DMA channel 2 transfer select 19: USCIB0 transmit</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_20</name>
                  <description>DMA channel 2 transfer select 20: USCIA1 receive</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_21</name>
                  <description>DMA channel 2 transfer select 21: USCIA1 transmit</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_22</name>
                  <description>DMA channel 2 transfer select 22: USCIB1 receive</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_23</name>
                  <description>DMA channel 2 transfer select 23: USCIB1 transmit</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_24</name>
                  <description>DMA channel 2 transfer select 24: ADC12IFGx</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_25</name>
                  <description>DMA channel 2 transfer select 25: Reserved</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_26</name>
                  <description>DMA channel 2 transfer select 26: Reserved</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_27</name>
                  <description>DMA channel 2 transfer select 27: USB FNRXD</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_28</name>
                  <description>DMA channel 2 transfer select 28: USB ready</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_29</name>
                  <description>DMA channel 2 transfer select 29: Multiplier ready</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_30</name>
                  <description>DMA channel 2 transfer select 30: previous DMA channel DMA1IFG</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_31</name>
                  <description>DMA channel 2 transfer select 31: ext. Trigger (DMAE0)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL2</name>
          <description>DMA Module Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DMACTL3</name>
          <description>DMA Module Control 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DMACTL4</name>
          <description>DMA Module Control 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ENNMI</name>
              <description>Enable NMI interruption of DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROUNDROBIN</name>
              <description>Round-Robin DMA channel priorities</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARMWDIS</name>
              <description>Inhibited DMA transfers during read-modify-write CPU operations</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIV</name>
          <description>DMA Interrupt Vector Word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DMA0CTL</name>
          <description>DMA Channel 0 Control</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>Initiate DMA transfer with DMATSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>DMA transfer aborted by NMI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIE</name>
              <description>DMA interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>DMA interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>DMA level sensitive trigger select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>DMA source byte</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>DMA destination byte</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>DMA source increment bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <description>DMA source increment 0: source address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <description>DMA source increment 1: source address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <description>DMA source increment 2: source address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <description>DMA source increment 3: source address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>DMA destination increment bit 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <description>DMA destination increment 0: destination address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <description>DMA destination increment 1: destination address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <description>DMA destination increment 2: destination address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <description>DMA destination increment 3: destination address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>DMA transfer mode bit 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <description>DMA transfer mode 0: Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <description>DMA transfer mode 1: Block transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0SZ</name>
          <description>DMA Channel 0 Transfer Size</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
