cr1901/msp430f5529/msp430f5529.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMPARATOR_B</name>
      <description>Comparator B</description>
      <baseAddress>2240</baseAddress>
      <registers>
        <register>
          <name>CBCTL0</name>
          <description>Comparator B Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBIPSEL</name>
              <description>Comp. B Pos. Channel Input Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBIPSEL_0</name>
                  <description>Comp. B V+ terminal Input Select: Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_1</name>
                  <description>Comp. B V+ terminal Input Select: Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_2</name>
                  <description>Comp. B V+ terminal Input Select: Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_3</name>
                  <description>Comp. B V+ terminal Input Select: Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_4</name>
                  <description>Comp. B V+ terminal Input Select: Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_5</name>
                  <description>Comp. B V+ terminal Input Select: Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_6</name>
                  <description>Comp. B V+ terminal Input Select: Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_7</name>
                  <description>Comp. B V+ terminal Input Select: Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_8</name>
                  <description>Comp. B V+ terminal Input Select: Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_9</name>
                  <description>Comp. B V+ terminal Input Select: Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_10</name>
                  <description>Comp. B V+ terminal Input Select: Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_11</name>
                  <description>Comp. B V+ terminal Input Select: Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_12</name>
                  <description>Comp. B V+ terminal Input Select: Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_13</name>
                  <description>Comp. B V+ terminal Input Select: Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_14</name>
                  <description>Comp. B V+ terminal Input Select: Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIPSEL_15</name>
                  <description>Comp. B V+ terminal Input Select: Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBIPEN</name>
              <description>Comp. B Pos. Channel Input Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBIMSEL</name>
              <description>Comp. B Neg. Channel Input Select 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBIMSEL_0</name>
                  <description>Comp. B V- Terminal Input Select: Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_1</name>
                  <description>Comp. B V- Terminal Input Select: Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_2</name>
                  <description>Comp. B V- Terminal Input Select: Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_3</name>
                  <description>Comp. B V- Terminal Input Select: Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_4</name>
                  <description>Comp. B V- Terminal Input Select: Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_5</name>
                  <description>Comp. B V- Terminal Input Select: Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_6</name>
                  <description>Comp. B V- Terminal Input Select: Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_7</name>
                  <description>Comp. B V- Terminal Input Select: Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_8</name>
                  <description>Comp. B V- terminal Input Select: Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_9</name>
                  <description>Comp. B V- terminal Input Select: Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_10</name>
                  <description>Comp. B V- terminal Input Select: Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_11</name>
                  <description>Comp. B V- terminal Input Select: Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_12</name>
                  <description>Comp. B V- terminal Input Select: Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_13</name>
                  <description>Comp. B V- terminal Input Select: Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_14</name>
                  <description>Comp. B V- terminal Input Select: Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBIMSEL_15</name>
                  <description>Comp. B V- terminal Input Select: Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBIMEN</name>
              <description>Comp. B Neg. Channel Input Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBCTL1</name>
          <description>Comparator B Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBOUT</name>
              <description>Comp. B Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBOUTPOL</name>
              <description>Comp. B Output Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBF</name>
              <description>Comp. B Enable Output Filter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBIES</name>
              <description>Comp. B Interrupt Edge Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBSHORT</name>
              <description>Comp. B Input Short</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBEX</name>
              <description>Comp. B Exchange Inputs</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBFDLY</name>
              <description>Comp. B Filter delay Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBFDLY_0</name>
                  <description>Comp. B Filter delay 0 : 450ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBFDLY_1</name>
                  <description>Comp. B Filter delay 1 : 900ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBFDLY_2</name>
                  <description>Comp. B Filter delay 2 : 1800ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBFDLY_3</name>
                  <description>Comp. B Filter delay 3 : 3600ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBPWRMD</name>
              <description>Comp. B Power Mode Bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBPWRMD_0</name>
                  <description>Comp. B Power Mode 0 : High speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPWRMD_1</name>
                  <description>Comp. B Power Mode 1 : Normal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPWRMD_2</name>
                  <description>Comp. B Power Mode 2 : Ultra-Low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPWRMD_3</name>
                  <description>Comp. B Power Mode 3 : Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBON</name>
              <description>Comp. B enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBMRVL</name>
              <description>Comp. B CBMRV Level</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBMRVS</name>
              <description>Comp. B Output selects between VREF0 or VREF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
