cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>CBCTL2</name>
          <description>Comparator B Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBREF0</name>
              <description>Comp. B Reference 0 Resistor Select Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBREF0_0</name>
                  <description>Comp. B Int. Ref.0 Select 0 : 1/32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_1</name>
                  <description>Comp. B Int. Ref.0 Select 1 : 2/32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_2</name>
                  <description>Comp. B Int. Ref.0 Select 2 : 3/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_3</name>
                  <description>Comp. B Int. Ref.0 Select 3 : 4/32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_4</name>
                  <description>Comp. B Int. Ref.0 Select 4 : 5/32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_5</name>
                  <description>Comp. B Int. Ref.0 Select 5 : 6/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_6</name>
                  <description>Comp. B Int. Ref.0 Select 6 : 7/32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_7</name>
                  <description>Comp. B Int. Ref.0 Select 7 : 8/32</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_8</name>
                  <description>Comp. B Int. Ref.0 Select 0 : 9/32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_9</name>
                  <description>Comp. B Int. Ref.0 Select 1 : 10/32</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_10</name>
                  <description>Comp. B Int. Ref.0 Select 2 : 11/32</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_11</name>
                  <description>Comp. B Int. Ref.0 Select 3 : 12/32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_12</name>
                  <description>Comp. B Int. Ref.0 Select 4 : 13/32</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_13</name>
                  <description>Comp. B Int. Ref.0 Select 5 : 14/32</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_14</name>
                  <description>Comp. B Int. Ref.0 Select 6 : 15/32</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_15</name>
                  <description>Comp. B Int. Ref.0 Select 7 : 16/32</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_16</name>
                  <description>Comp. B Int. Ref.0 Select 0 : 17/32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_17</name>
                  <description>Comp. B Int. Ref.0 Select 1 : 18/32</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_18</name>
                  <description>Comp. B Int. Ref.0 Select 2 : 19/32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_19</name>
                  <description>Comp. B Int. Ref.0 Select 3 : 20/32</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_20</name>
                  <description>Comp. B Int. Ref.0 Select 4 : 21/32</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_21</name>
                  <description>Comp. B Int. Ref.0 Select 5 : 22/32</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_22</name>
                  <description>Comp. B Int. Ref.0 Select 6 : 23/32</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_23</name>
                  <description>Comp. B Int. Ref.0 Select 7 : 24/32</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_24</name>
                  <description>Comp. B Int. Ref.0 Select 0 : 25/32</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_25</name>
                  <description>Comp. B Int. Ref.0 Select 1 : 26/32</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_26</name>
                  <description>Comp. B Int. Ref.0 Select 2 : 27/32</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_27</name>
                  <description>Comp. B Int. Ref.0 Select 3 : 28/32</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_28</name>
                  <description>Comp. B Int. Ref.0 Select 4 : 29/32</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_29</name>
                  <description>Comp. B Int. Ref.0 Select 5 : 30/32</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_30</name>
                  <description>Comp. B Int. Ref.0 Select 6 : 31/32</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF0_31</name>
                  <description>Comp. B Int. Ref.0 Select 7 : 32/32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBRSEL</name>
              <description>Comp. B Reference select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBRS</name>
              <description>Comp. B Reference Source Bit : 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBRS_0</name>
                  <description>Comp. B Reference Source 0 : Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBRS_1</name>
                  <description>Comp. B Reference Source 1 : Vcc</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBRS_2</name>
                  <description>Comp. B Reference Source 2 : Shared Ref.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBRS_3</name>
                  <description>Comp. B Reference Source 3 : Shared Ref. / Off</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBREF1</name>
              <description>Comp. B Reference 1 Resistor Select Bit : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBREF1_0</name>
                  <description>Comp. B Int. Ref.1 Select 0 : 1/32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_1</name>
                  <description>Comp. B Int. Ref.1 Select 1 : 2/32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_2</name>
                  <description>Comp. B Int. Ref.1 Select 2 : 3/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_3</name>
                  <description>Comp. B Int. Ref.1 Select 3 : 4/32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_4</name>
                  <description>Comp. B Int. Ref.1 Select 4 : 5/32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_5</name>
                  <description>Comp. B Int. Ref.1 Select 5 : 6/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_6</name>
                  <description>Comp. B Int. Ref.1 Select 6 : 7/32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_7</name>
                  <description>Comp. B Int. Ref.1 Select 7 : 8/32</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_8</name>
                  <description>Comp. B Int. Ref.1 Select 0 : 9/32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_9</name>
                  <description>Comp. B Int. Ref.1 Select 1 : 10/32</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_10</name>
                  <description>Comp. B Int. Ref.1 Select 2 : 11/32</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_11</name>
                  <description>Comp. B Int. Ref.1 Select 3 : 12/32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_12</name>
                  <description>Comp. B Int. Ref.1 Select 4 : 13/32</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_13</name>
                  <description>Comp. B Int. Ref.1 Select 5 : 14/32</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_14</name>
                  <description>Comp. B Int. Ref.1 Select 6 : 15/32</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_15</name>
                  <description>Comp. B Int. Ref.1 Select 7 : 16/32</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_16</name>
                  <description>Comp. B Int. Ref.1 Select 0 : 17/32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_17</name>
                  <description>Comp. B Int. Ref.1 Select 1 : 18/32</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_18</name>
                  <description>Comp. B Int. Ref.1 Select 2 : 19/32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_19</name>
                  <description>Comp. B Int. Ref.1 Select 3 : 20/32</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_20</name>
                  <description>Comp. B Int. Ref.1 Select 4 : 21/32</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_21</name>
                  <description>Comp. B Int. Ref.1 Select 5 : 22/32</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_22</name>
                  <description>Comp. B Int. Ref.1 Select 6 : 23/32</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_23</name>
                  <description>Comp. B Int. Ref.1 Select 7 : 24/32</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_24</name>
                  <description>Comp. B Int. Ref.1 Select 0 : 25/32</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_25</name>
                  <description>Comp. B Int. Ref.1 Select 1 : 26/32</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_26</name>
                  <description>Comp. B Int. Ref.1 Select 2 : 27/32</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_27</name>
                  <description>Comp. B Int. Ref.1 Select 3 : 28/32</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_28</name>
                  <description>Comp. B Int. Ref.1 Select 4 : 29/32</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_29</name>
                  <description>Comp. B Int. Ref.1 Select 5 : 30/32</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_30</name>
                  <description>Comp. B Int. Ref.1 Select 6 : 31/32</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREF1_31</name>
                  <description>Comp. B Int. Ref.1 Select 7 : 32/32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBREFL</name>
              <description>Comp. B Reference voltage level Bit : 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBREFL_0</name>
                  <description>Comp. B Reference voltage level 0 : None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREFL_1</name>
                  <description>Comp. B Reference voltage level 1 : 1.5V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREFL_2</name>
                  <description>Comp. B Reference voltage level 2 : 2.0V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBREFL_3</name>
                  <description>Comp. B Reference voltage level 3 : 2.5V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBREFACC</name>
              <description>Comp. B Reference Accuracy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBCTL3</name>
          <description>Comparator B Control Register 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBPD0</name>
              <description>Comp. B Disable Input Buffer of Port Register .0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD1</name>
              <description>Comp. B Disable Input Buffer of Port Register .1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD2</name>
              <description>Comp. B Disable Input Buffer of Port Register .2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD3</name>
              <description>Comp. B Disable Input Buffer of Port Register .3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD4</name>
              <description>Comp. B Disable Input Buffer of Port Register .4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD5</name>
              <description>Comp. B Disable Input Buffer of Port Register .5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD6</name>
              <description>Comp. B Disable Input Buffer of Port Register .6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD7</name>
              <description>Comp. B Disable Input Buffer of Port Register .7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD8</name>
              <description>Comp. B Disable Input Buffer of Port Register .8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD9</name>
              <description>Comp. B Disable Input Buffer of Port Register .9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD10</name>
              <description>Comp. B Disable Input Buffer of Port Register .10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD11</name>
              <description>Comp. B Disable Input Buffer of Port Register .11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD12</name>
              <description>Comp. B Disable Input Buffer of Port Register .12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD13</name>
              <description>Comp. B Disable Input Buffer of Port Register .13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD14</name>
              <description>Comp. B Disable Input Buffer of Port Register .14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPD15</name>
              <description>Comp. B Disable Input Buffer of Port Register .15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
