cr1901/msp430f5529/msp430f5529.svd
        <register>
          <name>CBINT</name>
          <description>Comparator B Interrupt Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBIFG</name>
              <description>Comp. B Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBIIFG</name>
              <description>Comp. B Interrupt Flag Inverted Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBIE</name>
              <description>Comp. B Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBIIE</name>
              <description>Comp. B Interrupt Enable Inverted Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBIV</name>
          <description>Comparator B Interrupt Vector Word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>RTC</name>
        <description>0xFFD2 RTC</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFD4 Port 2</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A1</name>
        <description>0xFFD6 Timer2_A5 CC1-4, TA</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A0</name>
        <description>0xFFD8 Timer2_A5 CC0</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>USCI_B1</name>
        <description>0xFFDA USCI B1 Receive/Transmit</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>USCI_A1</name>
        <description>0xFFDC USCI A1 Receive/Transmit</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFDE Port 1</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFE0 Timer1_A3 CC1-2, TA1</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFE2 Timer1_A3 CC0</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>DMA</name>
        <description>0xFFE4 DMA</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>USB_UBM</name>
        <description>0xFFE6 USB Timer / cable event / USB reset</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFE8 Timer0_A5 CC1-4, TA</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFEA Timer0_A5 CC0</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>ADC12</name>
        <description>0xFFEC ADC</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>USCI_B0</name>
        <description>0xFFEE USCI B0 Receive/Transmit</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>USCI_A0</name>
        <description>0xFFF0 USCI A0 Receive/Transmit</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF2 Watchdog Timer</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B1</name>
        <description>0xFFF4 Timer0_B7 CC1-6, TB</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B0</name>
        <description>0xFFF6 Timer0_B7 CC0</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>COMP_B</name>
        <description>0xFFF8 Comparator B</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA User Non-maskable</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC System Non-maskable</description>
        <value>62</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
